# Ordinal Number Encoding

In [158]:
import datetime

In [159]:
today_date=datetime.datetime.today()

In [160]:
today_date

datetime.datetime(2020, 9, 26, 21, 3, 25, 583697)

In [161]:
#one day difference
today_date-datetime.timedelta(1)

datetime.datetime(2020, 9, 25, 21, 3, 25, 583697)

In [162]:
#Two days difference
today_date-datetime.timedelta(2)

datetime.datetime(2020, 9, 24, 21, 3, 25, 583697)

In [163]:
###List Comprehension
[today_date-datetime.timedelta(x) for x in range(0,15)]

[datetime.datetime(2020, 9, 26, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 25, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 24, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 23, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 22, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 21, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 20, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 19, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 18, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 17, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 16, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 15, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 14, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 13, 21, 3, 25, 583697),
 datetime.datetime(2020, 9, 12, 21, 3, 25, 583697)]

In [164]:
#For converting date into datafarmes
import pandas as pd
data=pd.DataFrame(days)
data.columns=['Day']

In [165]:
data.head()

                         Day
0 2020-09-26 15:20:02.996869
1 2020-09-25 15:20:02.996869
2 2020-09-24 15:20:02.996869
3 2020-09-23 15:20:02.996869
4 2020-09-22 15:20:02.996869

In [166]:
data['Day']

0    2020-09-26 15:20:02.996869
1    2020-09-25 15:20:02.996869
2    2020-09-24 15:20:02.996869
3    2020-09-23 15:20:02.996869
4    2020-09-22 15:20:02.996869
5    2020-09-21 15:20:02.996869
6    2020-09-20 15:20:02.996869
7    2020-09-19 15:20:02.996869
8    2020-09-18 15:20:02.996869
9    2020-09-17 15:20:02.996869
10   2020-09-16 15:20:02.996869
11   2020-09-15 15:20:02.996869
12   2020-09-14 15:20:02.996869
13   2020-09-13 15:20:02.996869
14   2020-09-12 15:20:02.996869
Name: Day, dtype: datetime64[ns]

In [167]:
data['weekday']=data['Day'].dt.date
data.head()

                         Day     weekday
0 2020-09-26 15:20:02.996869  2020-09-26
1 2020-09-25 15:20:02.996869  2020-09-25
2 2020-09-24 15:20:02.996869  2020-09-24
3 2020-09-23 15:20:02.996869  2020-09-23
4 2020-09-22 15:20:02.996869  2020-09-22

In [168]:
data['weekday']=data['Day'].dt.month
data.head()

                         Day  weekday
0 2020-09-26 15:20:02.996869        9
1 2020-09-25 15:20:02.996869        9
2 2020-09-24 15:20:02.996869        9
3 2020-09-23 15:20:02.996869        9
4 2020-09-22 15:20:02.996869        9

In [169]:
data['weekday']=data['Day'].dt.year
data.head()

                         Day  weekday
0 2020-09-26 15:20:02.996869     2020
1 2020-09-25 15:20:02.996869     2020
2 2020-09-24 15:20:02.996869     2020
3 2020-09-23 15:20:02.996869     2020
4 2020-09-22 15:20:02.996869     2020

In [170]:
data['weekday']=data['Day'].dt.weekday
data.head()

                         Day  weekday
0 2020-09-26 15:20:02.996869        5
1 2020-09-25 15:20:02.996869        4
2 2020-09-24 15:20:02.996869        3
3 2020-09-23 15:20:02.996869        2
4 2020-09-22 15:20:02.996869        1

In [171]:
data['day']=data['Day'].dt.weekday
data.head()

                         Day  weekday  day
0 2020-09-26 15:20:02.996869        5    5
1 2020-09-25 15:20:02.996869        4    4
2 2020-09-24 15:20:02.996869        3    3
3 2020-09-23 15:20:02.996869        2    2
4 2020-09-22 15:20:02.996869        1    1

#### Count or Frequency Encoding

In [172]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [173]:
columns=[1,3,5,6,7,8,9,13]

In [174]:
train_set=train_set[columns]

In [175]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [176]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [177]:
for feature in train_set.columns[:]:
    print(feature,':',len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [178]:
train_set['Country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Trinadad&Tobago                  19
 Cambodia                         19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Hungary                          13
 Honduras                         13
 Scotland                         12
 Holand-Netherlands                1
Name: Country, dtype: int64

In [179]:
Country_map=train_set['Country'].value_counts().to_dict()

In [180]:
train_set['Country']=train_set['Country'].map(Country_map)
train_set.head(20)

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

#Advantages:

1.Easy To Use
2.Not increasing feature space

##Disadvantages:
1.It will provide same weight if the frequencies are same

## Target Guided Ordinal Encoding

1.Ordering the labels according to the target
2.Replace the labels by the joint probability of being 1 or 0

In [181]:
import pandas as pd
df=pd.read_csv('D:/Data Science/Python/Practise/titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [182]:
df['Cabin'].fillna('missing',inplace=True)

In [183]:
df['Cabin']

0      missing
1          C85
2      missing
3         C123
4      missing
        ...
886    missing
887        B42
888    missing
889       C148
890    missing
Name: Cabin, Length: 891, dtype: object

In [184]:
df.head(20)

    Survived    Cabin
0          0  missing
1          1      C85
2          1  missing
3          1     C123
4          0  missing
5          0  missing
6          0      E46
7          0  missing
8          1  missing
9          1  missing
10         1       G6
11         1     C103
12         0  missing
13         0  missing
14         0  missing
15         1  missing
16         0  missing
17         1  missing
18         0  missing
19         1  missing

In [185]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [186]:
df.head()

   Survived Cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [187]:
df.Cabin.unique()

array(['m', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [188]:
df.groupby('Cabin')['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: Survived, dtype: float64

In [189]:
df.groupby('Cabin')['Survived'].mean().sort_values

<bound method Series.sort_values of Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: Survived, dtype: float64>

In [193]:
ordinal_labels=df.groupby('Cabin')['Survived'].mean().sort_values().index

In [194]:
enumerate(ordinal_labels,0)

In [197]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [205]:
df['Cabin_ordinal_labels']=df.Cabin.map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     m                     1
1         1     C                     4
2         1     m                     1
3         1     C                     4
4         0     m                     1

# ##Mean Encoding

In [206]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [207]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'T': 0.0,
 'm': 0.29985443959243085}

In [211]:
df['mean_ordinal_encode']=df.Cabin.map(mean_ordinal)

In [212]:
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     m                     1             0.299854
1         1     C                     4             0.593220
2         1     m                     1             0.299854
3         1     C                     4             0.593220
4         0     m                     1             0.299854